springrestsoap/src/test/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://ankesh.com/springrestsoap/soap/dto">
    <soapenv:Header/>
    <soapenv:Body>

        <gs:addContactInfoSoapRequest>
            <gs:ContactInfoSoapRequest>
                <gs:contactName>"my contact"</gs:contactName>
                <gs:emailAddress>"my mail id"</gs:emailAddress>
                <gs:phoneNumber>"my phone no"</gs:phoneNumber>

            </gs:ContactInfoSoapRequest>
        </gs:addContactInfoSoapRequest>
    </soapenv:Body>
</soapenv:Envelope>